In [1]:
import pandas as pd

**Створюємо датафрейм:**

In [3]:
df = pd.DataFrame()

У відповідності до завдання наповнюємо датафрейм даними на 15 строк та 5 стовбців (15*5), що містить наступну інформацію:

а) Ім'я студента;

б) Прізвище студента;

в) Середній бал;

г) Оцінка за поточний екзамен;

д) Кількість спроб здачі поточного екзамену.

In [64]:
students = {
'First_name': ['Nick', 'John', 'Peter', 'Jack', 'Daniel', 'David', 'William', 'Joseph', 'Charles', 'Matthew', 'Donald', 'Paul', 'Kevin', 'Brian', 'Ronald'],
'Last_name': ['Anderson', 'Black', 'Bishop', 'Harris', 'King', 'Parker', 'Cooper', 'Morris', 'Davis', 'Watson', 'Ellis', 'Foster', 'Kelly', 'Palmer', 'Russell'],
'Average_mark': [88, 94, 70, 98, 80,  81, 65, 87, 70, 71, 79, 91, 57, 77, 69],
'Grade_for_the_exam': [90, 96, 68, 99, 84, 60, 91, 72, 77, 85, 97, 58, 81, 74, 92],
'Number_of_attempts': [1, 1, 3, 1, 2, 4, 2, 1, 3, 1, 1, 5, 2, 3, 1]
}

In [65]:
df = pd.DataFrame(data=students, index=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15])
df

   First_name Last_name  Average_mark  Grade_for_the_exam  Number_of_attempts
1        Nick  Anderson            88                  90                   1
2        John     Black            94                  96                   1
3       Peter    Bishop            70                  68                   3
4        Jack    Harris            98                  99                   1
5      Daniel      King            80                  84                   2
6       David    Parker            81                  60                   4
7     William    Cooper            65                  91                   2
8      Joseph    Morris            87                  72                   1
9     Charles     Davis            70                  77                   3
10    Matthew    Watson            71                  85                   1
11     Donald     Ellis            79                  97                   1
12       Paul    Foster            91                  58                   5
13      Kevin     Kelly            57                  81                   2
14      Brian    Palmer            77                  74                   3
15     Ronald   Russell            69                  92                   1

**Додамо до датафрейму стовпчик, що містить дані про допуск студента на наступний курс:**

In [143]:
admission_to_the_next_course = ['yes', 'yes', 'no', 'yes', 'yes', 'no', 'yes', 'yes', 'yes', 'yes', 'yes', 'no', 'yes', 'yes', 'yes']

In [144]:
df['Admission_to_the_next_course'] = admission_to_the_next_course
df

,First_name,Last_name,Average_mark,Grade_for_the_exam,Number_of_attempts,Admission_to_the_next_course
1,Nick,Anderson,88,90,1,yes
2,John,Black,94,96,1,yes
3,Peter,Bishop,70,68,3,no
4,Jack,Harris,98,99,1,yes
5,Daniel,King,80,84,2,yes
6,David,Parker,81,60,4,no
7,William,Cooper,65,91,2,yes
8,Joseph,Morris,87,72,1,yes
9,Charles,Davis,70,77,3,yes
10,Matthew,Watson,71,85,1,yes
11,Donald,Ellis,79,97,1,yes
12,Paul,Foster,91,58,5,no
13,Kevin,Kelly,57,81,2,yes
14,Brian,Palmer,77,74,3,yes
15,Ronald,Russell,69,92,1,yes

**Знайдемо мінімальний, максимальний, середній та медіанний показники середнього балу студентів:**

In [72]:
df['Average_mark'].agg(['min','max', 'mean', 'median'])

min       57.000000
max       98.000000
mean      78.466667
median    79.000000
Name: Average_mark, dtype: float64

**Знайдемо кількість студентів, які здали поточний екзамен з першого разу, тобто Number_of_attempts = 1:**

In [131]:
count = df.loc[df['Number_of_attempts'] == 1, 'Number_of_attempts'].count()
count

7

**Збережемо дані 'Average_mark' у вигляді серії:**

In [141]:
Average_mark = df['Average_mark']
Average_mark

1     88
2     94
3     70
4     98
5     80
6     81
7     65
8     87
9     70
10    71
11    79
12    91
13    57
14    77
15    69
Name: Average_mark, dtype: int64

In [142]:
type(Average_mark)

pandas.core.series.Series